[{"title": "Started this because of the anime.", "rating": "5.0 out of 5 stars", "review_text": "This covers the first couple episodes of the anime. I really like the series so far and can't wait, so I decided to but the manga. So far this follows spot on. I suggest enjoying both.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Worth the 6 bucks", "rating": "5.0 out of 5 stars", "review_text": "I got this because I saw the anime getting popular and idk paying for and reading the manga is easier than hunting down a free site for English subbed episodes. Anyways!! This definitely seems like an introduction book BUT ITS SO GOOD wow I literally cant wait to get the next one and maybe watch the anime?? Idk but I'm already in love with the main character so I'm hooked whoops", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Generic and rushed.", "rating": "3.0 out of 5 stars", "review_text": "I picked this up because I'd heard the anime based on this source material was taking the world by storm, and generally if an anime is based on a manga I opt to read it first before delving into the series. Perhaps I expected too much from this based on the hype, but I came out of it pretty disappointed. The story, while admittedly intriguing and dark, is also very generic, copy-paste-with-different-characters type of manga. To be certain, you have seen or read this before. That isn't always a deal breaker for me, as I actually like seeing how the familiar story we know and love might differ in another person's hands. However, in this case as it turns out, not all that well.  (Very minor spoilers ahead, but not much that isn't already on the back cover or in the item description.)  The story takes place in Taisho-era Japan (1912 - 1926) and our young protagonist, Tanjiro Kamado, is heading off down the cold and dangerous path from his mountain home into the town below to sell some coal so that he can help feed and clothe his family. He's greeted well by the townsfolk who seem to love him, and it's quickly revealed that Tanjiro seems to have an almost supernatural ability the rest of us do not (because of course he would), and the townspeople ask him to use it to aid in their squabbles, as well as requesting his assistance with other little things around the village. Before he knows it, it's getting very late, and the path home is even much more treacherous at night, as a kindly gentleman reveals to the reader that demons roam in the shadows of the woods. He insists Tanjiro stay the night with him, and return home in the morning, to which our little hero reluctantly agrees. The next morning he sets off back home, but to his horror, arrives there to find his family slaughtered. All perished with the exception of his little sister, who seems to have become a demon herself. Cue gag-worthy, cookie-cutter \"mysterious\" demon slaying stranger who's cold-hearted yet righteous (and much too young-looking to be so cynical), who decides he sees something special in our young Tanjiro and his fang-y little sister, and sends them to meet an even more mystifying sensei who will train Tanjiro to become the thing demons have nightmares about. Cue the Rocky theme song and really corny (and again oh-so generic) training montage that only takes up half a chapter, but is meant to span about two years time, in which Tanjiro doesn't seem to have aged at all other than some hair growth. There is also a suuuper, I'm talking extra large nacho cheese-y reveal at this point that actually made me snort and roll my eyes. Oh, and during all this training, Tanjiro’s sister has been (temporarily I’m sure) basically written out of the story for mere convenience sake, it would appear, due to some silly, lackluster excuse that happens off-page and barely explained to us in passing.  The whole thing feels entirely too rushed. It's as if the mangaka, Koyoharu Gotōge, is incredibly overeager to get to the juicy action, but doesn't want to bother with the \"boring\" parts of building up to that, like, you know, the actual story, which in turn makes you feel very little for the characters or what happens to them.  The art is another small issue that I personally had with it, as to be frank, it just doesn't measure up to a lot of other popular manga out there at the moment. Don't expect the polished look you get from a lot of your other favorites, with some really rough and jagged character line-work. Curiously, the backgrounds look better than the characters, albeit a bit lazy, and Koyoharu does put a lot of good (and I'm sure time-consuming) work and love into giving most characters their own fairly detailed clothing patterns.  At the end of the day, I didn't hate or even overly dislike this manga. The younger crowd who haven't been spoiled by better renditions of this familiar story are sure to love it. It was nothing new, or even very good, but it did allow me to sort of check out of reality and keep me turning the page somehow. I did find myself rushing through it, where I'll normally to take my time reading manga to appreciate the art, but it was an okay way to pass some time. That being said, it in no way has me in a hurry to read the next one. I will, as I'd like to be fair and give it one more chance and tie up the loose end the cliffhanger left me with, but if it doesn't improve in the second volume I may just switch to watching the anime, which looks to be more polished and improved upon, or abandon it entirely.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Excellent Shounen!", "rating": "5.0 out of 5 stars", "review_text": "The art uses some shaky lines that can be hard to get used to it one is accustomed to more smooth, finished styles, but this art sets off the story being told really well. It's not really anything new for shounen, so that leaves it to execute well, which it does. Also, Tanjiro, the main character, is an adorable, precious cinnamon roll, so there's that. :D", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Best Manga Series Ever", "rating": "5.0 out of 5 stars", "review_text": "I read a lot of manga... to the point where you would think I'm Japanese/in Japan if you saw my bookshelf.  Out of every series I've ever read Demon Slayer is my favorite. It just nails every possible checkmark for an action/shounen series. Absolutely spectacular.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Tanjiro begins his journey.", "rating": "5.0 out of 5 stars", "review_text": "Tanjiro is the compassionate and brave elder brother to his younger sister, Nezuko. My kids like Tanjiro's character very much. My kids are in high school and middle school. They enjoy reading about Tanjiro's experience training with Mr. Urokodaki. My kids admire Tanjiro's selfless acts of determination to help Nezuko and those in need. They also enjoy the parts of the story when Tanjiro receives help from those who came before them. My kids like how the author, Mr. Gotouge, gives the characters back stories to help the reader learn about the cruel aspects of life. They sympathized with the characters when they felt hope, sorrow, and happiness.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "It’s awesome", "rating": "5.0 out of 5 stars", "review_text": "It was a great story and in great English also don’t forget the fun pages in between chapters. It also shows stuff that they cut out of the anime and I really recommend reading it if you like the anime. I’m 14 and never got bored of it I even read it in a day, that’s just how good the volume one is.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Give it a Read!!!", "rating": "5.0 out of 5 stars", "review_text": "A very typical shonen manga. Young man faces tragedy, and vows to get revenge. There really isn’t to much in the first volume that will make you go wow. However there is something there. This manga has potential.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Very good premise, I am looking forward to continuing the series", "rating": "4.0 out of 5 stars", "review_text": "4 1/2* stars  This has been a popular series for awhile but I had not gotten around to reading any of it, until now.  The hype that I heard was right, this was so good! Within 20 pages the action already had me hooked and on the edge of my seat.  It's hard for me to find fault in manga, because, unless it's something I just straight-up don't agree with or can't get past, I will enjoy it no matter.  With that said, I'll tell you it is a typical Shonen manga where a weaker young man strives to get stronger to save/protect someone he loves, these kind of tropes are not turn off for me but I know to some they are, so I felt like it should be mentioned. However I believe once the story gets deeper in it will be a lot more than just a classic trope to hook people.  The art was great, it gave off a nostalgic vibe of mangas past, and I found that comforting in a way that made the darker parts of the story not so heavy, yet it also gave the comedic effects more of a realistic tone. When I started reading it, I did not realize that it was set in the Taisho era of Japan, so I kept thinking to myself why are the characters in these periodic costumes, but after learning that the story is set in a certain era and not just a fantasy world it made me appreciate the art a little more, especially the eye for detail to make the setting and characters appropriate for the time.  the characters are interesting and the plot is well rounded, I believe the story can only get better from here on out, and I plan to continue reading.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great Starting Manga Series", "rating": "4.0 out of 5 stars", "review_text": "It was a solid introduction into understanding Tanjiro and his sister Nezuko. We learn about how their village, specifically their family was attacked, and how Tanjiro's life will never be the same again. He unquestioningly jumps into the role of protector for his demon-changed sister and takes it upon himself, out of a sense of guilt, to find a way to change his sister back into a human.  Nezuko is an interesting character. Even though she doesn't really say anything, her emotions speak very loudly and clearly through her actions. I think Gotouge does an amazing job of showing these emotions through all the characters in a way that makes it easy to know where they are motivated from.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Intense", "rating": "3.0 out of 5 stars", "review_text": "This manga is the first I have picked up in decades. I found it for free via browsing the store. The book is gruesome, horrific, and intense. I thought the storyline is intriguing. I found myself rooting for the main character. I felt it ended on a cliff hangar, but I am unsure if that is something usually done in manga or author preference. I felt this book has layed down a solid foundation for great character growth and plot. The artwork is great. Overall, I thought it was well written.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "This came damaged", "rating": "3.0 out of 5 stars", "review_text": "Immediately after opening my mail, I saw that the spine was bent and ripped. I love this series of books but I'd be weary of the condition it might arrive in.  Also, who wants cracks on the cover art? I know I don't. These should be sent in small boxes or sealed between 2 stiff boards.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Soul", "rating": "5.0 out of 5 stars", "review_text": "Well done. Has emotion and soul. Nothing will blow you away, but there is a strong foundation for the series to follow.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "this entire series is amazing", "rating": "5.0 out of 5 stars", "review_text": "not really a fan of Japanese anime. this is the most popular series in Japan at this moment (I life outside Tokyo). It is very entertaining and is filled with symbolism of the transition of Japan to the industrial age and the effect on Japanese traditions and religious beliefs. It is also fun", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "A good start to a good series", "rating": "5.0 out of 5 stars", "review_text": "It's a good start to a good series.It's not perfect but it's still worth reading if you're a fan of anime or manga The story is simple It's about a young man trying to save his sister and Avenge his family And stop the 1 responsible for it.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Gift", "rating": "5.0 out of 5 stars", "review_text": "While I haven't read this myself I do know that the person in my life that reads this absolutely had fun with this series and plans on buying and reading more.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Good enough to check out the next volume", "rating": "4.0 out of 5 stars", "review_text": "I have to agree mostly with Jeff Blaine's review. The story is just interesting enough to want to know if it gets any better. There are several parts toward the half way mark that have bad pacing issues. Some large amount of time passes within the span of only a couple of panels. Then turn the page and it happens again. The story is pretty generic, but I'm not going to knock off points because of that, so I give it four stars instead of three. I'm a sucker for stories about demons and in my imagination I could see some potential routes the story could take that would make it interesting.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great series with one flaw in my opinion", "rating": "5.0 out of 5 stars", "review_text": "Great series so far. I really love it. I am about to start vol 9. My only complaint is that I wished certain things would’ve been explained better. Like the techniques or maybe some more of the lore. This may come in later volumes? Like I said its a minor complaint but if you’re familiar Naruto it would be the equivalent of him just randomly using the Rasengan or any character using jutsu with no explanation on how it is done with chakra and hand signs. If that makes sense.  At any rate. Definitely worth picking up", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great start", "rating": "5.0 out of 5 stars", "review_text": "I have been hearing about this series for a while and now regret not starting this series sooner. It's amazing!! Love the style of art but mostly the plot and storyline are fantastic and brilliant. Great work!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "An excellent read!", "rating": "5.0 out of 5 stars", "review_text": "I had heard good things about this manga and decided to buy it for Christmas. Although it does follow some of the typical shonen cliches, I enjoyed the read. The art was beautiful and it isn’t often that I see a story set in the Taisho era (circa 1910). I eagerly finished it and went on to the second volume.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Defective Print", "rating": "1.0 out of 5 stars", "review_text": "The book arrived with (more than pictured here) several faded, defective pages, which made it impossible to read it. Costumer service was helpful, but we're disappointed the item arrived in such poor condition.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Good Manga", "rating": "5.0 out of 5 stars", "review_text": "I love the demon slayer anime, so when I saw this was available for free I read it immediately, this is the same as the first few episodes on the anime, word to word I believe, recommended for manga readers.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "I love this❤❤❤❤❤💕💕💕💕💕💕💕💕💗💕💗💕💗💗💗💕💗💕💕💞💕💞💕", "rating": "4.0 out of 5 stars", "review_text": "Not only is it my favorite show/book it also has a good author that is a good person. Also it's not boring but it takes until volume like 4 to get to the mission with rengoku,its not recommended for kids to but that ok. I would rate every demon slayer manga like this but , I wouldn't . Also I love how the chapters count like every chapter ever made at that time also , most of the deaths a tragic and super sad . But at the same time I love it!💕💕💕💕💕💕also shinobu is my fav out of them all💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "DO NOT Pay Xtra to get it quicker!", "rating": "2.0 out of 5 stars", "review_text": "I paid an Xtra $10 to get this item quicker for my kid & it took 3 months to get! Even though it said if I paid the xtra I would get it in like 2 weeks. No it took months!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Grandson is ecstatic!", "rating": "5.0 out of 5 stars", "review_text": "Bought this book as a reward for y grandson. This graphic novel is hard to find in the US. It arrived on time and in good condition. My grandson says it is fabulous.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great Comic", "rating": "5.0 out of 5 stars", "review_text": "I watched the anime long before I found this. Good to see the series followed the comic so closely. If you like anime you will love this comic", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "A little pricey but this is hard to find right now", "rating": "5.0 out of 5 stars", "review_text": "My daughter will be super happy to get this on Xmas morning. Thank you so much.  Item arrived as described. Brand new, no damages.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Grandson Gift 🎁", "rating": "5.0 out of 5 stars", "review_text": "My grandson wanted this for Christmas and now I’m the greatest grandma for getting him started on a series he can read throughout 2022!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Good in my opinion", "rating": "5.0 out of 5 stars", "review_text": "I chose to read this because I've seen the anime before reading and the story caught me by surprise. In some aspects it's much like Naruto in how these characters are introduce and grow, but at a fast pace. I don't like that Nezuko acts like a dog. I did get much of who she is as a person, then again things happened and now we're here. I'll stop before I spoil anything for anyone that hasn't seen or read it.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Good start", "rating": "5.0 out of 5 stars", "review_text": "I have been looking for some new manga to read, and I picked this one because my cosine recommended it. Boy, was he right!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "😁", "rating": "5.0 out of 5 stars", "review_text": "My son love this book and if you go to the mall it's actually $15 if you buy them online it would actually cost you $7 my son's love it", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Intriguing.", "rating": "4.0 out of 5 stars", "review_text": "This isn't my usual genre of choice, but I liked this more than expected. I'm definitely going to continue this series.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great!", "rating": "5.0 out of 5 stars", "review_text": "It’s pretty good I enjoyed it some details weren’t in the show too which is interesting it’s definitely a great read", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "A Favorite", "rating": "5.0 out of 5 stars", "review_text": "I ordered this volume after a little after having finished the anime. Both have been extremely good so far and I love the characters. This volume came in quickly and in good condition. Definitely recommend the series. I am currently up to volume 12 in the series.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Awesome read", "rating": "5.0 out of 5 stars", "review_text": "Characters well developed. The story is riveting and you can’t put it down. I like the artwork too. I’ll probably bings read the entire series.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Amazing!", "rating": "5.0 out of 5 stars", "review_text": "Loved the first installment. Watched the anime and just had to have the set! Can’t wait to read them all!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Poorly handled shipment, Fantastic product and story", "rating": "1.0 out of 5 stars", "review_text": "I absolutely love Demon Slayer, the characters, the overarching story, and the art. That being said, I was thoroughly dissatisfied and disappointed when my copy arrived and looked as if it had been used by an elementary library for years… The cover is crumpled and scratched and many of the pages inside are crumpled and squished. I will update if the next one comes in better shape but for now it will stay as is.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Book came in excellent condition", "rating": "5.0 out of 5 stars", "review_text": "I love the demon slayer anime and was excited they have the manga as well. I got them on sale excellent", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Nice drawing", "rating": "5.0 out of 5 stars", "review_text": "Great beautiful drawing. Lovely characters. The story is pretty complicated. It is quite difficult for me to follow through the details.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great series", "rating": "5.0 out of 5 stars", "review_text": "Love this series! Perfect combination of comedy and action. Once you start reading, you won't beable to put this one down!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "decent manga", "rating": "4.0 out of 5 stars", "review_text": "This is a decent manga on demon slayer . good art work and dialogues.  Have the digital version", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great story!", "rating": "5.0 out of 5 stars", "review_text": "Demons, brave demon slayers, great story... What not to like in this? I'd recommend this Manga to anyone who likes action", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Love it!", "rating": "5.0 out of 5 stars", "review_text": "Was reccommended by a friend along with watching the anime. I'm curious to see where this takes me. Bought not only 1 but 7 books.  Also for those that are really iffy about book protection, just know, it comes in a regular packaging and not a protective box.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Awesome Manga", "rating": "5.0 out of 5 stars", "review_text": "I love the anime and this manga, I love it more too. I can't wait to buy more of these soon", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "So good", "rating": "5.0 out of 5 stars", "review_text": "SO happy with purchase, the cover looks great and the pages of panels look just as good, thank u so much!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great book", "rating": "4.0 out of 5 stars", "review_text": "My Son loved this book! He is 12 and it was a book that kept him entertained and didn't take long to read.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "I got earlier than expected", "rating": "5.0 out of 5 stars", "review_text": "I was hoping to get it before a kid’s birthday and thought it was gonna get here passing it. But to my surprise I got it sooner than expected. So much so that he almost saw it. Also the book’s condition was brand new. lastly I wanted to say that I saw some of the reviews and they seemed unfair so I decided to take the risk and give my first honest review. Thank you.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "great gift", "rating": "5.0 out of 5 stars", "review_text": "Item came in great packaging & excellent condition & was a great gift!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "One of the best", "rating": "5.0 out of 5 stars", "review_text": "One of the best storylines I've read in a long time concerning demons", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great Manga Series", "rating": "5.0 out of 5 stars", "review_text": "Beautiful book and great price. A book that finally came undamaged!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great item", "rating": "4.0 out of 5 stars", "review_text": "Great story line...can't wait for the next volume", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "The book that got me hooked", "rating": "5.0 out of 5 stars", "review_text": "Great series, I'm hooked. It's an easy read that is well worth your time.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Demon Slayer is amazing and the price is ok on this one", "rating": "4.0 out of 5 stars", "review_text": "Just happy it is in great condition and got it at a good price.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Awesome", "rating": "5.0 out of 5 stars", "review_text": "I started to read the mangas because of the anime and its like relieving all the amazing stuff. Highly recommended.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Gift", "rating": "5.0 out of 5 stars", "review_text": "Part of the collection. Kids reading the books with enthusiasm", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "10 out of 10", "rating": "5.0 out of 5 stars", "review_text": "Super fast shipping! Arrived in mint condition. Amazing Manga.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Beautiful agony", "rating": "5.0 out of 5 stars", "review_text": "You are always rooting for Tanjiro and the obstacles he prevails over. Each character does not have to say so much to get the meaning across.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Amazing!!", "rating": "5.0 out of 5 stars", "review_text": "Finally in stock!! It was sold out everywhere!! Thanks 🙏", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Goes great with my collection", "rating": "5.0 out of 5 stars", "review_text": "I love anime, and demon slayer was one of the first anime (anime’s? Idk) I watched. And I bought all the way up to 10 (I lent some to a friend) I won’t spoil it, but I love the end of 10 and will probably buy 11-13 soon.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great story", "rating": "5.0 out of 5 stars", "review_text": "Amazing story and character development! A must read!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great start to an amazing anime", "rating": "5.0 out of 5 stars", "review_text": "I first watched the anime - I am now reading the Manga and love it so far after the first volume. Can't wait to read more!!!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great Story cool Art", "rating": "5.0 out of 5 stars", "review_text": "This Manga is great, the story feels refreshing and uses art from ancient Japanese artists and brings it into a modern format. Kudos to the writer and artist on this series I’m glad it was picked up as an Anime.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Good start", "rating": "5.0 out of 5 stars", "review_text": "The genuine relationship between the siblings is cute. The main character seems like a good kid. The art is really interesting and cool", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Very good", "rating": "5.0 out of 5 stars", "review_text": "Having watched the anime first I knew that I would enjoy this very much and this has definitely been added to my favorites list.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Smells like coconut literally", "rating": "2.0 out of 5 stars", "review_text": "Book arrived smelling like coconut oil and pages falling out.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Devil Slayer", "rating": "5.0 out of 5 stars", "review_text": "Great!!! This series is a true masterpiece.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Almost perfect", "rating": "5.0 out of 5 stars", "review_text": "The manga itself is excellent. Love the story and can't wait to get the second vol. My only complaint is that upon receiving it there was a bend in the front and back cover...I am very annoyed by this.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Brand new", "rating": "5.0 out of 5 stars", "review_text": "No marks or damage to the book! Amazing book forced my friend to read it after watching the anime and he loves it now!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Manga", "rating": "5.0 out of 5 stars", "review_text": "Arrive in perfect conditions and in time, this was a gift for my boyfriend and he love it", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Teenage boys summer series 👍", "rating": "5.0 out of 5 stars", "review_text": "Teenage boys love em.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Makes me want to start the anime", "rating": "5.0 out of 5 stars", "review_text": "It’s pretty bloody. The main character is likeable. He’s not a crybaby like the My Hero Academia kid. I want more.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Fantastic Story", "rating": "5.0 out of 5 stars", "review_text": "Already watched the anime and loved it the manga is absolutely amazing and came in perfect condition which I am a stickler about with my manga.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Gave it to my 11 year old grandson, he loved it.", "rating": "4.0 out of 5 stars", "review_text": "He loved it.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Book was great but what’s better was the time it arrived.", "rating": "5.0 out of 5 stars", "review_text": "Daughter loved the manga and what I appreciated was the speed that it got here. Book arrived 4 days earlier then expected. Just in time for her birthday.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "𝗱𝗼𝗻'𝘁 𝗺𝗶𝘀𝘀 𝗼𝘂𝘁!", "rating": "5.0 out of 5 stars", "review_text": "This manga is great, I haven't read it yet as I'm waiting for tomorrow but I flipped through it and the art is great! I've read the digital manga and watched the anime so I wanted to collect the IRL manga. This is great! Just don't let little kids read this! :D", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Wonderful", "rating": "5.0 out of 5 stars", "review_text": "I've watched the anime and saw it on sale finally. Perfect & exactly as wonderful as the anime. Can't wait to see the details added im the Manga as I read more", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Fun", "rating": "5.0 out of 5 stars", "review_text": "She’s collecting all of them", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Perfect!", "rating": "5.0 out of 5 stars", "review_text": "The book came in beautiful condition! There were no scratches or rips!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Good starting Volume", "rating": "5.0 out of 5 stars", "review_text": "As a big fan of the anime show, I was excited to see how well they strayed/kept to the manga. Honestly, I'm impressed. They kept really close to the manga. Very excited to keep reading!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "It looked brand new and no folds", "rating": "5.0 out of 5 stars", "review_text": "The art style is so nice and the manga came in perfect shape! Would buy again!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "A great manga u must read", "rating": "5.0 out of 5 stars", "review_text": "Great story a must read, I like the slow but great character story where u get to know the characters.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great Series", "rating": "5.0 out of 5 stars", "review_text": "I Love This Series To Bits. I Have Watched The Anime Multiple Times And From What Ive Read Of The Manga Its Wonderful As Well!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Good deal on book", "rating": "5.0 out of 5 stars", "review_text": "Exactly what I was looking for at 62 Anime means nothing to me! Lol", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Amazing", "rating": "5.0 out of 5 stars", "review_text": "I love this whole concept of demons and demon Slayer. It brings out so much possibility and a great storyline 10/10 would recommend", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "I LOVE IT", "rating": "5.0 out of 5 stars", "review_text": "A great manga <3 I love the anime series. The manga gives it a whole new feel, telling a very well thought out story", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "THIS BOOK IS AMAZING", "rating": "5.0 out of 5 stars", "review_text": "I dislike nothing about this book, It’s amazing. Hope you enjoy the book is so good, I can’t stop reading.  Disclaimer: I did not read this book but clearly my daughter liked it.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Best Demon Slayer book!", "rating": "5.0 out of 5 stars", "review_text": "The Demon Slayer book came in great condition! Great buy.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great", "rating": "5.0 out of 5 stars", "review_text": "Daughter loves its", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great", "rating": "5.0 out of 5 stars", "review_text": "Great manga in perfect shape.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Nice book", "rating": "5.0 out of 5 stars", "review_text": "My daughter likes her book, shipping was fast,", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Excelente", "rating": "5.0 out of 5 stars", "review_text": "A mi hija le fascino", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "A fun read.", "rating": "5.0 out of 5 stars", "review_text": "This has been a fun read and the books give you more than the episodes.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Anime Granddaughter", "rating": "5.0 out of 5 stars", "review_text": "Granddaughter was very happy to receive this", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "WOW", "rating": "5.0 out of 5 stars", "review_text": "AMAZING! I haven’t read something I was this into since Tokyo ghoul. This is a must read for anyone who loves manga.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Read it! It's an adventure!", "rating": "5.0 out of 5 stars", "review_text": "Just enjoy this story and can't wait to see where it go. When a manga book get my attention i need to read it till the end.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Got curious", "rating": "4.0 out of 5 stars", "review_text": "Saw gifsets of this anime and wanted to see why it was so popular. I have to say I'm impressed!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Amazing !", "rating": "5.0 out of 5 stars", "review_text": "Its a good book i really like it just like the anime! I recommend reading it to my demon slayer fans!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Excellent Opening !", "rating": "5.0 out of 5 stars", "review_text": "Love love love the anime though I would try out the Manga so far not disappointed at all! Looking forward to the full series", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Fun read", "rating": "5.0 out of 5 stars", "review_text": "Love the illustration and the story is fantastic. The characters are engaging with nice depth. Can’t wait to read the next book!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Yes", "rating": "5.0 out of 5 stars", "review_text": ">.<>.<", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Good Manga", "rating": "5.0 out of 5 stars", "review_text": "This manga is awesome! The manga came in perfect shape and has no defects which is amazing but one thing I have to say is that the packaging it came in was not in a box and I was worried it was going to have creases but they all came in perfect shape which I’m happy with!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Book", "rating": "5.0 out of 5 stars", "review_text": "I think I wrote a wrong review and cannot undo. This book was in stock", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Better out there", "rating": "5.0 out of 5 stars", "review_text": "Ripping off eromanga sensei it’s like the same thing", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great", "rating": "5.0 out of 5 stars", "review_text": "As expected", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Love this show and now the manga", "rating": "5.0 out of 5 stars", "review_text": "Demon slayer is a great read. A mix of my hero and Inuyasha. I’ll definitely read the rest of the series.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Anime", "rating": "5.0 out of 5 stars", "review_text": "Great read LOVE this series definitely getting all of them", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Very Good Manga.", "rating": "5.0 out of 5 stars", "review_text": "The story is very good, Quality is top notch. You should definitely buy it.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Perfect mangas", "rating": "5.0 out of 5 stars", "review_text": "Perfect condition and great services 100%", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "An intriguing start", "rating": "4.0 out of 5 stars", "review_text": "Demon Slayer starts with a strong premise and likable characters. The style is simple yet striking and the action is clear. I can’t wait to see what comes next!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great shounen manga", "rating": "5.0 out of 5 stars", "review_text": "This has become my new favorite manga! The art style is phenomenal and the characters you see along the way really bring this manga to life.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Amazing!!!!", "rating": "5.0 out of 5 stars", "review_text": "Best series I have ever read since Naruto. Highly recommend this series", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Awesome:)", "rating": "5.0 out of 5 stars", "review_text": "Awesome my son is thrilled!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Meh", "rating": "3.0 out of 5 stars", "review_text": "This package came like 3 months later and it was stocked. But the Manga was Really good I would recommend the book but maybe not the shipping, It’s just my opinion.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Wonderful book", "rating": "5.0 out of 5 stars", "review_text": "just wish it was cheaper so I could buy the whole series", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "⭐️⭐️⭐️⭐️⭐️", "rating": "5.0 out of 5 stars", "review_text": "Perfect!💖💖", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "perfect", "rating": "5.0 out of 5 stars", "review_text": "just like picture.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Amazing! 10/10 recommend", "rating": "5.0 out of 5 stars", "review_text": "Love it! Read it pretty fast, cant wait to finish :D", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "N/a", "rating": "5.0 out of 5 stars", "review_text": "N/a", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Amazing.", "rating": "5.0 out of 5 stars", "review_text": "The show follows the show pretty well definitely a great read!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Manga is life", "rating": "5.0 out of 5 stars", "review_text": "Got my book excellent condition ... no ripped Pages or damages or anything", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "BEUTIFUL", "rating": "5.0 out of 5 stars", "review_text": "BEST ANIME SINCE POKEMON AND DBZ IN MY OPINION", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "LOVE", "rating": "5.0 out of 5 stars", "review_text": "Such an amazing series. The art is lovely and the story is INCREDIBLE!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Fantastic", "rating": "5.0 out of 5 stars", "review_text": "I got into Demon Slayer because of the anime and movie. I purchased the first manga and I’m hooked all over again. The story is fantastic", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Generally good (:", "rating": "5.0 out of 5 stars", "review_text": "I saw this while searching over Amazon and I remembered I watched the TV Show a year ago. I ordered it, and I got next day delivery! It literally came 8 hours after I ordered it. Good manga. I recommend it.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Yes!", "rating": "5.0 out of 5 stars", "review_text": "Yesssssssssss!!!!!!!!!!!!!!! Yesss!!! Yes!! Yes!!! Yess!! Yess!!!! Awesome first volume!! Getting the second one right now. You can do it Tanjiro!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "great, exactly what you'd expect", "rating": "5.0 out of 5 stars", "review_text": "delivers very fast, great picture, no bends. all in all its perfect", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "simply epic", "rating": "5.0 out of 5 stars", "review_text": "didnt watch the anime to start fresh when reading the book, and this was amazing. totally recomended", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Best manga series", "rating": "5.0 out of 5 stars", "review_text": "This is the best manga series there is. A lot of action the main character has a lot of lore, just pure greatness", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Just as good as the anime", "rating": "5.0 out of 5 stars", "review_text": "the art work on the cover might throw you off but the manga art is actually very good", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Buenos mangas !!", "rating": "5.0 out of 5 stars", "review_text": "He comprado todos los volúmenes con la misma persona y todos en perfecto estado llegan gracias !!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Love it thanks shawty", "rating": "5.0 out of 5 stars", "review_text": "The book cover is so shiny I'm gonna get more Manga from this seller 😍", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Show may be better?", "rating": "3.0 out of 5 stars", "review_text": "Looks like the show added to the story line in in character development. But slowed it down with constantly repeating lines.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "This was an amazing manga", "rating": "5.0 out of 5 stars", "review_text": "This book ended on a perfect cliffhanger and is by far my favorite manga. I highly suggest this amazing manga.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Loved it", "rating": "5.0 out of 5 stars", "review_text": "I watched the anime and this was honestly very good. I had no regrets getting this manga. The anime stays very true to this.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great writing and awesome art", "rating": "5.0 out of 5 stars", "review_text": "Really liked the art style and the way sword movment is captured on paper. Great Manga to start your weeb day with.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Gave me a full view of what it was, it also gave me a good laugh.", "rating": "5.0 out of 5 stars", "review_text": "I chose this rating because i watched the anime and it was great, I'd tell my friends to read this. Overall, I have no bad comments.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "damaged", "rating": "2.0 out of 5 stars", "review_text": "product came damaged", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "So excited to read", "rating": "5.0 out of 5 stars", "review_text": "It came a little late and I was a little bummed, thinking it was lost in the mail, but I just got it and I’m so excited to read it!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Intense", "rating": "5.0 out of 5 stars", "review_text": "Set in a world that is both different and familiar, the pacing is excellent and the characters draw draw you in.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "very quick delivery, perfect condition!", "rating": "5.0 out of 5 stars", "review_text": "They were great, quick delivery, everything was perfect!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Love it", "rating": "5.0 out of 5 stars", "review_text": "I love this book. I am into this stuff. It really leaves you on edge. I would recommend if you like anime and manga.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Perfect 🖤🖤", "rating": "5.0 out of 5 stars", "review_text": "Gifted this to my boyfriend for his birthday, perfect nothing wrong with the book- will purchase the rest!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great book!", "rating": "5.0 out of 5 stars", "review_text": "I loved the anime, it was great, so reading the manga was even better! I can’t wait to finish the other books!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great!", "rating": "5.0 out of 5 stars", "review_text": "If you prefer reading manga than watching the anime, then read this. For being the first volume, it gets straight into the fighting.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Happy with purchase", "rating": "5.0 out of 5 stars", "review_text": "Book arrived quickly and in perfect shape. Very pleased with purchase.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Amazing", "rating": "5.0 out of 5 stars", "review_text": "I loved the book i read it in one day i definitely recommend there was no damage no nothing it was like brand new and now i’m getting volume 2 and 3", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Gret", "rating": "5.0 out of 5 stars", "review_text": "Very Clean, No marks or visable signs of any damage at all. Very satisfied", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "GREAT MANGA", "rating": "5.0 out of 5 stars", "review_text": "This is a great first manga if you are new to anime. I HIGHLY recommend this manga.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Amazing", "rating": "5.0 out of 5 stars", "review_text": "I actually saw season 1 first, that's why I wanted to buy the books. Totally worth it. Demon slayer is amazing.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Worth It!", "rating": "5.0 out of 5 stars", "review_text": "Everything Came in as new!!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great book", "rating": "5.0 out of 5 stars", "review_text": "It arrived in perfect shape and was definitely a fun read. If you enjoy anime and manga, I definitely recommend this book.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Amazing product!", "rating": "5.0 out of 5 stars", "review_text": "Product was sealed and in mint condition. Shipping was fast! I will buy from this vendor in the future.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "really good", "rating": "5.0 out of 5 stars", "review_text": "I love the art style. ugh i hate it ended on a cliff hanger. the story is very intense and interesting", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Nice", "rating": "5.0 out of 5 stars", "review_text": "Came In good Quality", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "If it’s in good shape and if it’s In English not Japanese cause I only know English", "rating": "5.0 out of 5 stars", "review_text": "It’s in perfect shape, brand new and so nice! It’s English don’t worry I love it so much and can’t wait to read it!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great series", "rating": "5.0 out of 5 stars", "review_text": "I love demon slayer! This book is great", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "cant put it down", "rating": "5.0 out of 5 stars", "review_text": "Easy fast read. One of the best manga series by far.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Recommend", "rating": "5.0 out of 5 stars", "review_text": "I totally recommend it.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "It was great", "rating": "5.0 out of 5 stars", "review_text": "I loved it it was the best thing i read in a long time and his backstory was sad but good", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "its so goooooooodddooodoodd", "rating": "5.0 out of 5 stars", "review_text": "loloh", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Read it!!", "rating": "5.0 out of 5 stars", "review_text": "This is a must-read manga!!!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Best manga ever", "rating": "5.0 out of 5 stars", "review_text": "This manga really set my path for anime, it will always be a classic", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Just wasnt for me.", "rating": "1.0 out of 5 stars", "review_text": "I needed something to read on the plane. Story just wasn't for me.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Good", "rating": "5.0 out of 5 stars", "review_text": "I’m mean it’s good it’s my first manga that I got and I like it", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "AMAZING", "rating": "5.0 out of 5 stars", "review_text": "it's not even good it's amazing", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Love this series!!!", "rating": "5.0 out of 5 stars", "review_text": "If you love My Hero Academia, then you’ll love this too!!!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "It is perfect 🤩", "rating": "5.0 out of 5 stars", "review_text": "It’s perfect it came in perfect shape, there weren’t any rips, and it didn’t even come with folded corners. :))", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Love it", "rating": "5.0 out of 5 stars", "review_text": "Love the book and the condition of the book was great", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Destroy the demon", "rating": "3.0 out of 5 stars", "review_text": "I hate this comic too much, and it's been a long time", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great manga!", "rating": "5.0 out of 5 stars", "review_text": "Great Manga!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "must read", "rating": "5.0 out of 5 stars", "review_text": "must read", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "swaggy 😎😎", "rating": "5.0 out of 5 stars", "review_text": "Video Player is loading.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Love it", "rating": "5.0 out of 5 stars", "review_text": "Came early my son is going to Love this", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great manga", "rating": "5.0 out of 5 stars", "review_text": "Highly recommend this man's for anyone who enjoys manga. Very exciting and well written. The anime is really good too.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great Story", "rating": "5.0 out of 5 stars", "review_text": "Very interesting story so far, started off strong and I hope it continues to do well.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "It awesome", "rating": "4.0 out of 5 stars", "review_text": "I loved the story line but it left on a clif hanger😢😂", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "big chungus", "rating": "5.0 out of 5 stars", "review_text": "very cool", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "yes", "rating": "5.0 out of 5 stars", "review_text": "very good cried a bit tbh", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "good", "rating": "5.0 out of 5 stars", "review_text": "took a long time to come buts its fine", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Animation style", "rating": "3.0 out of 5 stars", "review_text": "Things feel too hasty, like comics, but did not hate", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "GIYUU LMAOAO", "rating": "5.0 out of 5 stars", "review_text": "GIYUU LOOKS GREASY WHEN HE MADE HIS FIRST APPEARANCE", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "It’s a great read", "rating": "5.0 out of 5 stars", "review_text": "Can’t wait for volume 2", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "No lo necesito", "rating": "1.0 out of 5 stars", "review_text": "Pedido accidental", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "It is very neat made, came very fast! And it is in GREAT shape and condition In general 😊😊😊😊", "rating": "5.0 out of 5 stars", "review_text": "ITS SOOO GOOD!!!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great product", "rating": "5.0 out of 5 stars", "review_text": "Great product. Arrived in great condition.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "It’s to be expected", "rating": "5.0 out of 5 stars", "review_text": "I have to do this", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Remember to check the reviews And the ratings of a product", "rating": "5.0 out of 5 stars", "review_text": "Yay It came in good condition. Like the product 😁", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Good not bad", "rating": "4.0 out of 5 stars", "review_text": "It came in good and im really enjoying it", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "I bought it new and it’s awesome", "rating": "5.0 out of 5 stars", "review_text": "", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Damaged item", "rating": "1.0 out of 5 stars", "review_text": "The pruduct was damaged when i got it", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "I love it", "rating": "5.0 out of 5 stars", "review_text": "I’m gonna collect all the volumes", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great chapter", "rating": "5.0 out of 5 stars", "review_text": "Product arrive on time and in good condition, I highly recommend his manga for new manga readers.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Not boring", "rating": "5.0 out of 5 stars", "review_text": "IT WAS VERY ACTION", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "stain", "rating": "4.0 out of 5 stars", "review_text": "The condition is good but in one page it has a stain so I guess the book isn’t brand new but it’s okay.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "it arrived quickly, without any damage.", "rating": "5.0 out of 5 stars", "review_text": "Perfect", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Trash", "rating": "1.0 out of 5 stars", "review_text": "This book is trash", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Slay!", "rating": "5.0 out of 5 stars", "review_text": "Amazing storyline!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "amazing", "rating": "5.0 out of 5 stars", "review_text": "yeah", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "finishing the season", "rating": "4.0 out of 5 stars", "review_text": "Ilike the story.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "AMAZING", "rating": "5.0 out of 5 stars", "review_text": "I LOVE ITTTTT", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": ":?", "rating": "5.0 out of 5 stars", "review_text": "Shinobu dies", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "100 especial", "rating": "5.0 out of 5 stars", "review_text": "Especial", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "great manga", "rating": "5.0 out of 5 stars", "review_text": "👍", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": ".", "rating": "5.0 out of 5 stars", "review_text": "An awesome manga", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "very cash money", "rating": "5.0 out of 5 stars", "review_text": "great :)", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "BUY IT", "rating": "5.0 out of 5 stars", "review_text": "It came brand-new,arrived on time loved it would totally recommend", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "😎😎", "rating": "5.0 out of 5 stars", "review_text": "THIS IS SO GOOD WJJWNWBSMA", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "AMAZING", "rating": "5.0 out of 5 stars", "review_text": "i legit love this i’m ordering the next one when i’m done", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great Quality", "rating": "5.0 out of 5 stars", "review_text": "The book came in great condition, and gives off that new book smell :)", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Don't expect to be satisfied with just volume 1", "rating": "5.0 out of 5 stars", "review_text": "Great manga for a great price .", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Demon fun!", "rating": "5.0 out of 5 stars", "review_text": "Recommend for any Shonen fan!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "How are the books stored in warehouses..", "rating": "4.0 out of 5 stars", "review_text": "Just opened the book and there's something sticky... gross.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "New book", "rating": "5.0 out of 5 stars", "review_text": "Great book and mail out very fast.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "A brother's love is stronger than any demon!", "rating": "4.0 out of 5 stars", "review_text": "Tanjiro and his family have a hard life, being rather poor. But Tanjiro works hard and does what he can to help provide for his mother and many siblings after the death of his father. Hoping to provide for a happy New Year for his loved ones, the weary Tanjiro wants to go into town, despite the weather, to sell more charcoal. But he is prevented from getting back and ends up spending the night there, heading home at first light. Upon his return, he is met with the horrific sight of his family, dead and bloody from some sort of massacre. The stricken Tanjiro realizes his sister Nezuko is still breathing, and hurries to get her to town, where she can be helped. When he slips and accidentally drops her, he realizes that Nezuko has become a demon, turned by the same creature that killed his family!  Just after this realization hits him, as he attempts to keep his demon sister from biting him, a stranger unexpectedly swoops in and attempts to kill her. He is confused as to why Tanjiro, a human, should be protecting a demon. But Tanjiro tells him that she’s his sister and he will do everything he can to help her become human again. He tells the stranger that Nezuko hasn’t killed anyone and won’t harm anyone. He finally persuades the man, whose name is Giyu, and Giyu tells him to go to see an old man named Sakonji Urokodaki at the foot of Mount Sagiri, and to tell him Giyu Tomioka sent him.  In order to travel that far, Tanjiro realizes he can’t avoid sunlight, much as Nezuko would like to, so he acquires an old basket and fixes it up for her so he can carry her on his back. On the journey, they are attacked by a demon, but luckily they are met by Urokodaki, in a tengu mask, who was apprised of their arrival by Giyu. Giyu told him Tanjiro seems promising, and has the same strong sense of smell that Urokodaki does. The older man makes Tanjiro figure out how to kill the demon himself then leads both him and Nezuko back to his mountain, never cutting the boy any slack. He leaves Tanjiro at the top of the mountain and says he’ll train him if he can make it down by morning. Tanjiro thinks that’s easy, with his sense of smell, but of course it isn’t.  Tanjiro has taken his first step toward becoming a Demon Slayer and recovering his sister’s lost humanity.  I have been watching the anime, and just started reading the manga. I really like it, and I think they complement one another well. It’s a sad story about bravery in the face of tragedy, of a brother’s love for his sister and his determination to give her back the life she had before, as well as a supernatural story about demons and humans. Tanjiro is a sweet boy, and very kind. Sometimes too kind, to the point of being indecisive, which his mentor fears in his nature. But he also has a steely quality that I think will stand him in good stead in the future.  Urokodaki’s tengu mask is intriguing, and I’m sure there’s a story as to why he always wears it, one we will find out later. A side note, the actor who voices Urokodaki in the anime is the same one who voices Jiraiya in Naruto (win-win for me because I love Jiraiya lol) The story of how Tanjiro splits the boulder is sadly sweet. Tanjiro’s trial as part of the final selection to become a demon slayer is filled with intrigue and potential death for all involved. Not all the candidates will come out alive.  I like the artwork very much, and I look forward to reading more volumes.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "I liked this beginning and it's kind of retro feel", "rating": "3.0 out of 5 stars", "review_text": "'Demon Slayer: Kimetsu no Yaiba, Vol. 1' by Koyoharu Gotouge is a manga about a young boy learning to fight demons.  Tanjiro's fmaily lives in the mountains. One day he visits home and his entire family has been attacked by monsters. The only survivor is his little sister Nezuko. Wisdom says he should kill her, but there is still a bond between them. Now if Tanjiro can become a demon fighter, maybe he can find a way to help her.  I liked this story and characters. It had a nice retro feel in story and art. The story seems really grim, but doesn't become oppressively so. I wouldn't mind reading more in this series.  I received a review copy of this manga from VIZ Media and NetGalley in exchange for an honest review. Thank you for allowing me to review this manga.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Kimetsu no Yaiba lives up to the hype! And watch the anime too!", "rating": "5.0 out of 5 stars", "review_text": "I love this series so much! The story revolves around the siblings Tanjiro (demon slayer) and Nezuko (demon). It has some weird humor at times like when Nezuko will suddenly kick a demon's head off out of nowhere and this series is set during the Taisho period. If you liked Inu Yasha, you will surely like this series! There's some beautiful spreads when Tanjiro finally fights the first demon with his sword with the Water techniques.  To be honest, I would recommend buying several volumes at once if you're reading this series. You can also read the first 3 chapters for free on Shonen Jump website (Viz) or Manga Plus (Shueisha). This series is currently being simulpubbed in English and Spanish on Manga Plus too. Also, most of the volumes are available in the Shonen Jump subscription vault if you don't mind reading digitally!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Loved Tanjiro + Nezuko !", "rating": "5.0 out of 5 stars", "review_text": "I voluntarily offered to review this book with no obligations and my opinions are honest! This was a great book ! I saw the anime, before reading the Manga. Tanjiro comes home to discover that a demon has murder his family. His sister is the only survivor, Nezuko. Now, Tanjiro is training to be a Demon slayer to protect his sister. One day, he hopes to transform his sister into a human again. Loved the characters + the storytelling ! It has all the ingredients that you need for a great book! I can't wait for the next book in this series.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Demon Slayer, Vol 1", "rating": "4.0 out of 5 stars", "review_text": "Demon Slayer: Kimetsu by Yaiba, Vol. 1 by Koyoharu Gotouge is a free NetGalley e-manga that I read in early February.  A family lives in an unforgiving polar forest when one of the sons realizes that things are falling apart around him and that demons from the woods are starting to emerge and attack. It's kind of a wandering Western saga where he takes his partway-demonized sister with him, encounters friend and foe, then is accepted as an apprentice demon slayer on the premise that he completes several different trials.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Family First.", "rating": "5.0 out of 5 stars", "review_text": "I binged the anime at my husbands rec and absolutely loved it. I also love reading and have been wanting to get back into manga for a while now so figured I'd start with this since it fit a readathon challenge. The beginning is so heartbreaking but Tanjiro's determination is inspiring. Nezuko is just as adorable on paper as she is on screen. It did end in a cliff hanger so you will most definitely need to get the second book asap!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Manga vs Anime?", "rating": "4.0 out of 5 stars", "review_text": "The anime followed the manga storyline and pacing pretty well. I found some of the scenes on the manga exactly similar to the anime. Down to the character’s line and which pose the character said it which in my opinion is impressive. It’s nice to see effort being placed into small details like that.  I’m not much of a manga reader. I read them once in a while, but I thought this was a manga that can stand out from the rest. It reminds me of Bleach in a way, especially with special katanas and fighting demons.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Very good manga", "rating": "5.0 out of 5 stars", "review_text": "Kimetsu no Yaiba is very underrated. The artwork is very well drawn, the writing is really good and it avoids some of the cliches associated with the shonen manga genre. As I've read this series more and more it's become one of my favorite ongoing series.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "wow 😮", "rating": "5.0 out of 5 stars", "review_text": "I usually don’t read shonen but this one is really good. Action packed and historical. I love it and can’t wait to read the next volume.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "about the anime", "rating": "4.0 out of 5 stars", "review_text": "the anime is so cool and fun and the weirdest part (in anime) is the dude (hes a hashira) the dude that was amazed about Tanjiro and her little sis", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "If you're a fan of the anime you will also love the manga", "rating": "5.0 out of 5 stars", "review_text": "And if you haven't seen the anime yet I envy you because it will be amazing as you encounter it for the first time.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "It's a a shonen with demons, there you go that's how you know if you'll like it", "rating": "4.0 out of 5 stars", "review_text": "Not much to say about the book. It's a normal action shonen, but it executes fairly well and that is what matters  It won't light your world on fire but you should have a good time with it", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Amazing", "rating": "5.0 out of 5 stars", "review_text": "To good not to read I love the anime and this Really good I recommend you read this I i", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "o.o", "rating": "5.0 out of 5 stars", "review_text": "noice my dude I'll keep reading cuz I like the show and I don't wanna wait for season 2 but I'll still watch it lolol", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Amazing", "rating": "5.0 out of 5 stars", "review_text": "Loved it. Recommended", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Must watch the anime version", "rating": "5.0 out of 5 stars", "review_text": "Love", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Perfect", "rating": "5.0 out of 5 stars", "review_text": "It was amazing, I just love demon slayer so much. I got this for free to so even better, im glad", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "10/10", "rating": "5.0 out of 5 stars", "review_text": "Words can't describe this Manga. Purchase it and you will be blessed I promise.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "OK by my standard", "rating": "3.0 out of 5 stars", "review_text": "It came in perfect condition everything was fine with it the story on the other hand was a bit lackluster so I think this will be my only purchase of this line I may revisit it but it was OK", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "So incredibly...", "rating": "5.0 out of 5 stars", "review_text": "Good! I used to hate the idea of reading manga. I thought it was start-up only for weeks. I was wrong. Read this. I'm hooked.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Highly recommend😏", "rating": "5.0 out of 5 stars", "review_text": "Worth the money but if you watched the show first don’t get the first book get the seventh book.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Really good read", "rating": "5.0 out of 5 stars", "review_text": "One of the first manga I've read but im already hooked . The other being jojo's bizarre adventure part 6.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Love this", "rating": "5.0 out of 5 stars", "review_text": "A very good and entertaining manga. I love the art style as well. I cannot wait to read more.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "amazing", "rating": "5.0 out of 5 stars", "review_text": "so good the feels", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Están en español", "rating": "3.0 out of 5 stars", "review_text": "Esta enespañol", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great Manga", "rating": "5.0 out of 5 stars", "review_text": "Not really into anime/manga much anymore, but I watched the Anime and wanted to get into the manga to see what happens. Solid start, and beautiful art in the book too. Strongly recommend this to Shonen lovers. It feels very different because of the sad start to the series, and Tanjiro is a softer, less loud shonen protagonist who has a very innocent wish; to save his sister.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great anime comics", "rating": "5.0 out of 5 stars", "review_text": "Great and fun comic. Fast delivery, packaged well and the paper is good quality.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "The kids enjoyed them", "rating": "5.0 out of 5 stars", "review_text": "These keep the kids busy along with the adults.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "It's amazing just as shown do order it", "rating": "5.0 out of 5 stars", "review_text": "This was amazing manga thankyou I loved it and it is the real thing as shown do order I recommend", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "10/10", "rating": "5.0 out of 5 stars", "review_text": "Looking for a manga to read, then check out this one! It has a great story, and shows great character development! Definitely worth the money!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "wanted to see the manga after watching", "rating": "5.0 out of 5 stars", "review_text": "Saw season one and the movie and got some fan art based on the manga so i am just catching up and reliving some phenomenal moments cheers", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Great shape", "rating": "5.0 out of 5 stars", "review_text": "It came a little earlier than expected and it came in great shape as well overall I have no complaints whatsoever.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "perfect", "rating": "5.0 out of 5 stars", "review_text": "I got this as a gift for my little sister and it was perfect. It arrived way faster than the eta", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "BUY IT!", "rating": "5.0 out of 5 stars", "review_text": "the quality is amazing and u need to buy!!!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "My niece loved it", "rating": "5.0 out of 5 stars", "review_text": "She asked for more!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "It’s cool", "rating": "5.0 out of 5 stars", "review_text": "Its great for people just getting into manga", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "Delivered quick & in New condition", "rating": "5.0 out of 5 stars", "review_text": "No marks or blemishes on the inside or out of the manga.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": "10/10", "rating": "5.0 out of 5 stars", "review_text": "It has no imperfections 10/10", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Just amazing! Characters are awsome, and fox masks! Avid anime watcher however thought I’d get a manga to try while I smoke, turned out best decision since brexit! Now to tackle coronavirus like a demon it should be slain.. or the coronavirus ‘cure’ victims that turn into flesh eating demons? 5* Stars! Keep a katana close and enjoy the read!  **note, nothing in this manga has anything to do with the current world crisis Covid-19 outbreak", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Set in the early 20th Century, 'Demon Slayer: Kimetsu no Yaiba' follows the young Tanjiro Kamado on his journey to become a demon slayer after his family is slaughtered, and his younger sister transformed into an unusual demon. This first volume includes the first seven chapter of the entertaining series that has some great art, some nice humour and an interesting setting. The volume only has a little action, but what is there is well done. The characters all seem good at this early stage, and while the plot hasn’t gotten going yet, it has some very nice moments that make me want read the rest of the series as soon as possible.  The Kindle version of the volume that I read is nicely done, with the pages easy to read, and included the author’s introduction and afterword. I will definitely be looking to get more manga on the Kindle in the future.  Overall, this was a very good start to the series that has certainly got me hooked and is worth a solid four stars.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Started this manga after first watching the anime adaption currently airing witch is awesome as is this manga . Buy it", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "I've grown quite tired of how inept Western comics have become in regards to writing lately. Too preachy, lackluster art, characters more bland than cardboard flavoured bran flakes.  Demon Slayer is the first time in a long time a graphic novel or comic has captured my complete attention. On top of the art being genuinely brilliant, the story is well written and you connect with the protagonist, Tanjiro almost immediately. You feel his desperation, his plight, you want to see him succeed in his goals the story has laid out.  On top of being well written, the story is also presented in a way where the pacing makes it easy to get into. I bought and finished this first volume this morning and by the end I didn't hesitate to pick up the next one. You're enthralled instantly with this world and the characters within them as well as the lore being set up too.  In short for those that prefer to skip to the end of this little review: TL;DR.  Great art, compelling protagonist and side characters, well written and paced to make it easy for newcomers to get into, the action is easy to follow. If any of that piques your interest then definitely give this a read.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "The story it's really beautiful and the drawings are so interesting in a good way .I'm not surprised why everybody does like/love Demon Slayers because, I am a fan of this amazing story and I'm quite interested on seeing what will happen next in the volume 2,3,4 etc. I will recommend to other manga/anime lovers to read/watch Demon Slayers(even for my family an friend who are not that much into anime and manga hehe )", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "I really like demon slayer as I have read it online before so i know that this story is definitely worth a read! Love the art style and the story.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "cool book", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "I enjoyed this first volume and I’m excited to read more. I like how it gradually explains how demons operate without being too info-dumpy. I liked seeing Tanjiro have to push himself to fully grasp the teachings of his master.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "My daughter loves this book but I was very disappointed to see its paper quality , I bought it for my daughter to give her as a gift but now I changed my idea.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Haven’t had such a good feeling about a Shonen since Naruto. I love this book. Now four volumes in and the world is becoming more and more interesting for every page I turn.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "My son loves it", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Friend is a manga comic lover so recipient loved receiving this", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "I bought this after watching the anime and it is definitely better. Well worth the price.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "A great shounen manga filled with emotions, a thrilling story and great characters... the best part the anime elevates the whole manga to another level....", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Daughter pleased with this book", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Loved it. I watched the series and now reading the manga! Loved the art work. Super easy to read and really enjoyable.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Good value for money", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Great gift.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Good book", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "like it", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Son is very happy", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Came in quickly and bran new everything was as described", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "This was an AMZING book! I’ve seen the anime and wanted to collect all of the manga.The front cover was in perfect condition as well as the rest of the book.And if your new to manga it did not come the wrong way that’s how JAPANSE books are :)", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "This is quite possibly the best manga of this decade. Highly recommended read. It can be a bit violent and gruesome but if you are ok with that then you will certainly enjoy it.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Went to buy the book after watching the show just as good this is my first steps into manga in my opinion demon slayer is a good starting point", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Read this entire series on the Shonen Jump app and it’s one of the best I’ve ever read. Really great characters and storyline!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Came nicely packed with no damage to the book! Presents for my partner and his little sister and they both love them!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "It do be a good manga but im pretty sure the driver tried to steal it as the box it came in was ripped open pretty sus anyway it arrived early and its in good condition", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "I loved the anime and I wanted to read the books and I am really enjoying it I can't wait to read more", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Loved the anime hope I will love the manga", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "First one is never the best one. But it definitely gets better in future volumes", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Arrived in good condition and no damage. Good book also.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Honestly love the series of demons slayer is fantastic I love collecting manga and love this product came on time and fast delivery amazing", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "100% recommend this to anyone thinking of starting anime. Great purchase, even better to store on my kindle. Must read!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Book came in perfect condition,no marks or scratches.Also came 10 days early.100% recommend this!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "perfect! nothing to complain about!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "I haven't read it, as it is for at gift", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Great read, love the artwork throughout & look forward to reading the rest of the series", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Came in perfect quality in short time with no dents or scratches and a great storyline.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "this type of books interest me.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Kid was happy", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Awesome read as sonis the series's", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Best manga ever!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "😮😮😮", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Already read the manga through the internet but having it in the actual book is sooo worth it", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "It’s really good and good looking", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Really good quality, it came on time and i love it so far!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Propper sick manga", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "IT WAS AMAZING", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "arrived early good price, great series i recommend watching the anime too if not already seen", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Confesso que eu esperava muito mais pelos comentários acerca do filme e tudo o mais. Não conhecia o universo do Demon Slayer e comecei por este volume. Os traços são simples, a história é simples. Talvez represente bem a essência do mangá japonês de décadas atrás, mas, para uma obra recente (começou a ser publicada em 2016) fica faltando um 'quê'. A história se inicia e 'termina' neste mesmo volume. Explico-me. O protagonista nem sabe o que é um Demon Slayer e, ao final das páginas, já está prestes a passar na seleção que o oficializará como Demon Slayer. Isso tudo acontece em menos de 200 páginas. O traço é simples, boas ilustrações, mas nenhuma que mereça ser um pôster ou que te deixará de boca aberta. A diagramação no kindle é boa, a leitura segue o estilo tradicional dos mangás (direita para esquerda) também.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Enquanto ainda não temos a edição Brasileira em mãos.... Kimetsu no Yaiba é ideal para os amantes de um excelente Battle Shonen, a animação fabulosa trouxe uma imensidão de fãs para essa obra e não é para menos, realmente muito bom. A qualidade dessa edição da Viz é bem OK ....Bem semelhante ao que temos no Brasil .", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Got for it otakus", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Ich habe bereits den Anime zu Kimetsu no yaiba geschaut. Der ist scheinbar wirklich nah am Manga gehalten das freut mich. Der Manga hat einen traurigen Mainplot, aber mit vielen schönen Momenten und Erinnerungen. Außerdem gibt es immer wieder einige lustige Stellen. So dass keine durchgehend quälend traurige Stimmung aufkommt sondern eine ernste Stimmung mit Abwechslung von schönen, witzigen, traurigen Momenten. Sehr gelungen. Der erste Teil ist ein super Auftakt und macht Lust auf mehr.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "El dibujo está muy bien! Después de ver el anime es interesante leer la obra original, es el 1er manga que tengo en kindle y me gusta el detalle de que el orden de las páginas es contrario al occidental.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Generischer Zeichenstil ohne jedweden Sinn für Action oder mitteissende Inszenierung, fade & träge Handlung, Hauptcharakter hat null Persönlichkeit... nicht mal die Witze zünden. Selbst Müll wie Fairy Tail hat da mehr Unterhaltung zu bieten.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Não tive problemas com a compra. Tudo certo também com o produto, conforme descrito.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Me pareció muy interesante y entretenido este primer volumen, definitivamente voy a continuar con los mangas y quizás también con la serie.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Great read, son's loves the series.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Since it's been bursting in popularity, especially the anime, I've been wanting to check out the Demon Slayer manga. Great condition, really not much to say.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "When the book came I thought it was in pretty good condition, until i noticed some gunk on the spine that appeared to be gum or sticky tack, there were also a few scratches. But other than that i’m was in good shape.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "英語に触れるための方法として、漫画は良いものと思います。 私はAmazonプライムで鬼滅の刃のアニメを流しながら、この本を読んでました。この言い回しは英語でこう解釈されるんだなぁと面白い発見もあります。 ただカッコいい技名を英語で書いてしまうとこうなるんだという幻滅もあります。まあこれはこれでネタとして面白いなと思いますが、やはり全訳は難しいですね。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Me llegó en el tiempo indicado.  Pedí varios tomos y todos me llegaron en muy buen estado. Ahora pasarán a formar parte de mi colección.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "I ordered Demon Slayer Vol.1 but recieved Vol.6 instead. The condition of the book was excellent. No complaints regarding that. I've read the manga online but I love collecting physical copies (Anyone collecting mangas would know what I'm talking about). So personally I don't mind at all because I'll be collecting all the volumes either way.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "What more can I say for a fabulous story! This is a compelling manga that makes you wanna follow the main character after witnessing such epic action scenes! Go, go, Tanjiro!!! 😁", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Got this as a gift for my partner and they loved it!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "super story super zeichnung super caraktere also ich mag giyu am meisten aber das ist egal jedenfalls aber es fehlen ein paar szenen aus der serie das ist meine einzige kritik  great story greate drawings grate carakters giyu is my favorite caraker but that doesn't matter they didnt put all scenes out the serie in the book thats my only kritik", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Demon slayer is one of the best new gen manga to start with. I received my manga without any defects and the it is amazing through and through, will be collecting the other volumes as well! Will recommend to all anime and manga lovers 😄", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "the story is next level and art work is also good. But the price is little high", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Bin zufrieden. Nur musste ich mein Paket bei den Nachbarn suchen, da jemand mit meinem Namen unterschrieben hat, statt mit dem eigenen.😐", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Everything but the price is perfect. I inderstand that it is imported but the peice should be lowered co sidering its such a thin book...", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Arrived on time. Well packaged. As expected.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Literally the best manga", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Baixe o ebook para o Kindle, mas o mesmo trava na pagina da capa, quando conseguimos escolher por capitulo, logo que passamos pra frente, ele volta a pagina da capa, creio quer seja um erro, na conversão do mesmo.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Los mangas me llegaron en muy buenas condiciones, lo cual agradezco mucho :D Sin embargo no tenía separador ninguno de los dos :/ Eso le baja puntos al producto.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Bem embalado! Entregue antes do tempo previsto. Muito satisfeito com a qualidade!!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "LLegó en tiempo y forma, en buenas condiciones. Lo recomiendo", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "I ordered the three first volumes together since I had seen the anime by this point and let me tell you the art style is phenomenal and its really imersive. They all came well packaged and were in mint condition.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "O mangá e incrível, mas infelizmente não posso comprar as próximas edições, estão com preços ridículos para nosso país, eu não consigo entender esse valor de 8 dólares na Amazon us Para 95 reais", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Manga incrível e tocante, já li duas vezes e sempre me emociono. 🤓🌹", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "i mostly order my manga from amazon and tbh im not satisfied w the quality at all. a couple of pages are dirty for some reason and i dont understand why. i love the manga but why amazon.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Best book ever I am going to read all of them going to read literally everything because one is so good I think everyone is going to go interesting", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Love this manga. Quick delivery arrived in great condition", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Es muy bueno, está bonito que sea en alta resolución, pero no esperaba que fuera en inglés", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "nice art , good storyline and its popular", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Muito bom, mesmo! Eu comecei a gostar depois de assistir a primeira temporada do anime. Fiquei tão empolgado que fui atrás do mangá. Recomendo, a leitura é fácil e prende a atenção.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Excelente, ainda mais sendo um presente. Mangá gratuito.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Ótimo mangá, vale a compra :)", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Clean, crisp and in mint condition. Also it arrived very fast. I highly recommend this seller. I will definitely be ordering more. ^_^", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "El estilo artístico se siente como arte japonés tradicional antigüo y la historia es atrapante desde el primer panel. Gracias por hacer que este primer volumen fuese gratuito.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Prodotto tenuto molto bene, non è arrivato danneggiato, molto interessante e consigliatissimo m", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Estou comprando as brasileiras e quero tentar conseguir a coleção americana também.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Amazing book", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "There was no damage. It came in a perfect condition.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Ich liebe das so sehr.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Pues eso muy recomendable. Un buen Shonen, de los mejores actualmente. Aprovechad que está de forma gratuita hasta el 25 de mayo.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Good read only issue is it goes by fast. Like drugs", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "One of my absolute favorites. The animé is also amazing. Caracters are very unique, funny and different from all other anime characters I know.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Minha filha achou incrível, está ansiosa por mais volumes. Ela já leu até o número 5, achei o texto e as imagens incríveis.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "No lo he leído, pero este es un buen anime.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "The manga does not seem legit kind of disappointed ☹️", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Me gustó mucho el anime y después vine a leer el manga y es una obra de arte mi capítulo favorito es la danza del dios de Fuego", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Amazing story", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Excelente manga, la historia te atrapa y deseas conocer más detalles al avanzar con la trama. Una obra moderna más que recomendable.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Melhor anime de 2019", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Muito bom. Chegou antes da data prevista em perfeito estado.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Just received it today. I'm glad of my purchase, but i'm quite sad the corners are bent.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "I luv demon slayer and even better, this book is $0 XD it's so very awesome!!!! five stars!!!!!! all the way perfecto!!!!!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Es magnífico, muy genial la historia te hace centrarse, las peleas son lo más épico de todo el manga 10000/10", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Gratis", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Um dos melhores de todos!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Meu filho tem interagindo bastante com os livros durante a pandemia.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Came in perfect condition. Greta book and great artwork . But the delivery was too late", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "I'm completely in love. The way that tanjiro is a charismatic boy made me feel like he was a friend", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Valeu a pena mas valeu a pena mas valeu a pena mas valeu a pena que coisa do Carvalho vinha do", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "La historia es buena y el acceso al mismo es sencillo.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Ótima leitura.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Awesome great artwork love it now my demon slayer collection is complete.❤️❤️", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Its Nice but the problem i found was that some text was a little bit fadded But you can still read it", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Bien.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Amazing is all I have to say . Came in great condition", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "É a mesma história do anime. Mas a arte é inferior, na minha opinião.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Thanks !! A lot ...the manga came in perfect condition and is very good", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Que mas se puede decir, buenísimo esta manga.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "El mi manga favorito", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "muito boom gente,ta em inglês mas esse mangá é incrível recomendo!!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "This book is awesome and made kind a good", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Amazing! It came perfect, wasn’t damaged and came just on time :)", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Compre la versión kindle por error, como pido reembolso?", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "¡Esta en perfecto estado! Y llego en el tiempo que se dijo.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "História boa, mas é ruim de ler no Kindle.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "GOSTARIA DE SABER COMO FAÇO PARA RASTREAR????????????????", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Good book delivered quickly and arrived in perfect shape.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Ordered after watching the show - it's great", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Llego sin forro protector.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Amei amei", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Muy divertido el manga", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Adorei, é fácil de folhear e bem legal a história", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Llegó muy bien el manga", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "yes amazing beautiful buy now", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Just amazing, read it if you are a manga enthusiast.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "great item,quickly posted", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Excelente", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Spare the book. Watch the anime", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Was delivered quickly and came in great condition", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Very Satisfied with the product...Even though the price is high.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Arrived in great condition!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Lo quisiera en español", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Peguei se graça no kindle, tô amando", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Nezuko is best girl", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Excellent quality", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Muy buen manga", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Chegou antes do previsto. Muito boa a qualidade do mangá. Adorei.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "I loved", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Produto exatamente como descrito", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Excelente produto, chegou em perfeito estado", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "アメリカ版、鬼滅の刃。Vol.1を購入。まだまだ、先は長い。もちろん、殆ど読めません。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "super", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "辞書を引きながら読んでますが、昔習ったなあという懐かしい英語が出てきて楽しい。内容は日本語版で分かっているので読み進めやすい。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "この作品の台詞回しがやはり再現しきれていません。 例えば『妹がもぐらになってしまった』というクスッとする表現は、『妹がモグラみたいになってしまった』と比喩表現になっていて、やっぱりニュアンスがちがいますよね。 『生殺与奪の権を、、』の名台詞も『敵の前でそんな無防備になるんじゃない！』みたいな言い回しです。 ただ、英語自体は簡単な言い回しが多いので、これをきっかけに英語に触れ直したり、お子様に英語への興味を持たせる目的だと良いのではないでしょうか。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "学校の授業で使っています。 今は鬼滅の刃で英語の授業やると、生徒の反応がいいですよ＾＾ ただ、学校英語では教えない表現も多数あるので、学校英語でがちがちな先生は逆に扱いにくいかも。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "大きなダンボールに本が2冊、ボールペンの替芯が入っていました。 緩衝材の紙がクシャクシャと入れてあった為、本に傷等はありませんでしたが、本は袋等に入れられず裸のまま入れてありました。 本屋さん等で見かける様な透明なフィルムに覆われて来るのかと思っていたので残念でした。 本などの紙類は雨などの湿気で濡れないように袋詰め等して発送して頂きたいです。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "日本語版と併読すれば 生きた英語が学べます。登場人物の汚い台詞を含めカッコいい台詞 胸に刺さる台詞が英語ではどのように自然な英語になるのかが分かります。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "そこまで細かくはチェックしてないけど、英語の勉強にいいでしょう。今は翻訳のマンパワーも充実しているでしょうから、下手な仕事はしてないはず、です。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "What a shocking and cruel start! I really recommend you all and hope more people all of the world enjoy it. It is worth reading indeed for every generation.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "好きな漫画で英語表現を学びたいと思って買いました。日本語の行間から伝わるものが削がれてしまったと感じる所もありますが、英語版でもやっぱり鬼滅は最高です！", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "きめつが大好きなので、英語版をみせて少し興味をもってもらおうと購入してみました", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "中学の子供にせがまれて購入。でも英語の勉強をしっかりとしおり、辞書を片手に翻訳中！！", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "英文が全文大文字なので、慣れるまで読みにくいですが、3級合格した中学生と少しずつ読み進めました。 サポートが必要ですが、シンプルな英文もあり、楽しんで読みました。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "話は面白いてすが、この日本語を英語で伝える限界を感じました。絵をみて概ねストーリーが分かってしまうので、英語の多読教材としては向いていないと思いました。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "長文が苦手な人にお勧め。難しい表現を使わないので辞書を引かなくても数時間で読めてしまう優れもの。 英語漫画を読んだことがない人は是非試して。全集中などのトレンドワード、実生活でも使えるよ。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "読みやすい英語で楽しい。 唯一、年号が王朝扱いになってるのが日本人的にモヤモヤする。 いや、大筋には関わりのないことで大したことでもないんだけど…。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "新品買ったのに親指で掴んで折ったように表紙折れてました。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "I lorve ittttt🥰 can't wait to buy the second book☺️", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "英語が大文字だけで、若干読みづらくかんじます。 電子本ではなく通常のコミックを出版してほしいと思います。パソコンを持ち歩けないので・・ 英語学習に生かそうと考えていましたが、今のところ期待外れ感が大きい状態です。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "I love it! This comic is useful for English learners inJapan.", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "読みやすいです。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "品質問題なし！そして綺麗！ 最高すぎて良い！ この本は外国にも売っていて少し高いが価値はある！", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Good", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "英語学習のため購入。大好きな作品なので飽きずに読み切れました", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "高校三年生向けに買いました 漫画を通じて英語が好きになったようです", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "鬼滅の刃が大好きで何回も繰り返し読んでいる娘のために、英語に興味を持ってもらおうと購入しました。 日本語版と、比べながら一生懸命読んでいます。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "英語のリーディング教材として購入しました。内容も面白いので、普通の英語教材のように飽きることなく読めそうです！", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "日本独特の表現を英語でどう表現するのかという点に注目しながら読み進めました！ とても良いです！", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "大好きな鬼滅の刃を、日本語と比べながら読む いやーいいわあ。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "日本版より高いですが、英語の勉強目的に購入しました。 読み比べてみると、楽しめるかと思います。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "英語の勉強にと思い購入しました。 それほど難しい単語はないので、英語の勉強になるでしょう。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Kindle版だとカバー裏の絵が未収録です。そこだけ注意", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "子どもの英語の勉強用に買いました。見てくれるか、わからんけど。", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Nice new book! Cool story!", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}, {"title": null, "rating": null, "review_text": "Perfect", "book name": "Demon Slayer: Kimetsu no Yaiba, Vol. 1: Cruelty"}]